class StringBuilder {
    #value;
    constructor(initialValue = '') {
        this.#value = String(initialValue);
    }

    getValue() {
        return this.#value;
    }  //повертає поточне значення приватної властивості value.
    padEnd(str) //— отримує параметр str (рядок) і додає його в кінець значення приватної властивості value об'єкта, який викликає цей метод.
padStart(str) //— отримує параметр str (рядок) і додає його на початок значення приватної властивості value об'єкта, який викликає цей метод.
padBoth(str) //— отримує параметр str (рядок) і додає його на початок і в кінець значення приватної властивості  value об'єкта, який викликає цей метод.

}